package com.example.ads.Zhulima;

import java.util.List;
import java.util.Arrays;

public class 修饰符 {
    public static final List<String> DECOR_CHARS = Arrays.asList(
        "̀", "́", "̂", "̃", "̄", "̅", "̆", "̇", "̈", "̉",
        "̊", "̋", "̌", "̍", "̎", "̏", "̐", "̑", "̒", "̓",
        "̔", "̕", "̖", "̗", "̘", "̙", "̚", "̛", "̜", "̝",
        "̞", "̟", "̠", "̡", "̢", "̣", "̤", "̥", "̦", "̧",
        "̨", "̩", "̪", "̫", "̬", "̭", "̮", "̯", "̰", "̱",
        "̲", "̳", "̴", "̵", "̶", "̷", "̸", "̹", "̺", "̻",
        "̼", "̽", "̾", "̿", "́", "̀", "́", "̀", "́", "̀",
        "ͅ", "͆", "͇", "͈", "͉", "͊", "͋", "͌", "͍", "͎",
        "͏", "͓", "͔", "͕", "͖", "͗", "͘", "͙", "͚", "͛",
        "͜", "͝", "͞", "͟", "͠", "͡", "͢", "ͣ", "ͤ", "ͥ",
        "ͦ", "ͧ", "ͨ", "ͩ", "ͪ", "ͫ", "ͬ", "ͭ", "ͮ", "ͯ",
        "ꙻ", "ⷪ", "꙼", "꙽", "꛰", "꛱"
    );

    public static final List<String> SMILE_EMOJIS = Arrays.asList(
        "😀", "😃", "😄", "😁", "😆", "😅", "😂", "🤣", "😊", "😇",
        "🙂", "🙃", "😉", "😌", "😍", "🥰", "😘", "😗", "😙", "😚",
        "😋", "😛", "😝", "😜", "🤪",  "🤓", "😎", "🤩",
        "🥳", "😏", "🤗", "🤭", "😯", "🤤"
    );

}
